-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Апр 07 2019 г., 09:56
-- Версия сервера: 10.1.37-MariaDB
-- Версия PHP: 7.1.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `calc_operations`
--

-- --------------------------------------------------------

--
-- Структура таблицы `calc_table`
--

CREATE TABLE `calc_table` (
  `id` int(11) NOT NULL,
  `first_operands` int(20) NOT NULL,
  `operations` varchar(20) NOT NULL,
  `second_operands` int(20) NOT NULL,
  `results` varchar(30) NOT NULL,
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `calc_table`
--

INSERT INTO `calc_table` (`id`, `first_operands`, `operations`, `second_operands`, `results`, `created`) VALUES
(1, 5, '-', 5, '0', '2019-04-03 00:37:10'),
(2, 5, '-', 5, '0', '2019-04-03 00:37:20'),
(3, 5, '-', 5, '0', '2019-04-03 00:37:29'),
(4, 10, '*', 4, '40', '2019-04-03 00:37:40'),
(5, 10, '*', 4, '40', '2019-04-03 01:00:32'),
(6, 7, '/', 2, '3.5', '2019-04-03 01:06:32'),
(7, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:10:43'),
(8, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:26:19'),
(9, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:28:47'),
(10, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:31:32'),
(11, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:31:33'),
(12, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:32:25'),
(13, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:37:58'),
(14, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:38:00'),
(15, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:38:01'),
(16, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:39:00'),
(17, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:42:04'),
(18, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:42:43'),
(19, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:44:03'),
(20, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:44:31'),
(21, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:46:03'),
(22, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:47:58'),
(23, 90, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»', '2019-04-03 01:49:27'),
(24, 100, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»Ð¸Ñ‚ÑŒ Ð½Ð', '2019-04-03 01:52:39'),
(25, 100, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»Ð¸Ñ‚ÑŒ Ð½Ð', '2019-04-03 01:52:49'),
(26, 100, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»Ð¸Ñ‚ÑŒ Ð½Ð', '2019-04-03 01:52:50'),
(27, 100, '/', 0, 'ÐÐ° Ð½Ð¾Ð»ÑŒ Ð´ÐµÐ»Ð¸Ñ‚ÑŒ Ð½Ð', '2019-04-03 01:52:51'),
(28, 5, '-', 3, '2', '2019-04-07 07:15:24'),
(29, 5, '-', 3, '2', '2019-04-07 07:15:30'),
(30, 5, '*', 6, '30', '2019-04-07 07:32:23'),
(31, 5, '*', 6, '30', '2019-04-07 07:32:35'),
(32, 5, '/', 5, '1', '2019-04-07 07:34:29'),
(33, 7, '+', 6, '13', '2019-04-07 07:37:23'),
(34, 7, '+', 6, '13', '2019-04-07 07:38:14'),
(35, 9, '/', 3, '3', '2019-04-07 07:43:26'),
(36, 2, '-', 10, '-8', '2019-04-07 07:50:47'),
(37, 4, '/', 2, '2', '2019-04-07 07:53:40');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `calc_table`
--
ALTER TABLE `calc_table`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `calc_table`
--
ALTER TABLE `calc_table`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
